rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
static const AppAI_ModelStageSpec app_ai_obb_stage = {
	.stage_label = "obb_face_v2_int8",
	.model_image_path = APP_AI_OBB_XSPI2_MODEL_IMAGE_PATH,
	.nn_instance = &NN_Instance_obb_face_v2_int8,
	.network_init_fn = LL_ATON_EC_Network_Init_obb_face_v2_int8,
	.inference_init_fn = LL_ATON_EC_Inference_Init_obb_face_v2_int8,
	.uses_rectifier_box = false,
	.xspi2_chip_offset = APP_AI_XSPI2_OBB_CHIP_OFFSET,
	.xspi2_base_addr = APP_AI_XSPI2_OBB_BASE_ADDR,
};

static bool AppAI_ShouldLogStageDiagnostics(
	const AppAI_ModelStageSpec *stage)
{
	(void)stage;
	return true;
}

static float AppAI_ClampNormalizedUnitFloat(float value)
{
	if (!isfinite(value))
	{
		return 0.0f;
	}
	if (value < 0.0f)
	{
		return 0.0f;
	}
	if (value > 1.0f)
	{
		return 1.0f;
	}
	return value;
}

static float AppAI_DecodeQuantizedScalar(
	const LL_Buffer_InfoTypeDef *buffer_info,
	const int8_t *raw_value_ptr)
{
	const float scale =
		(buffer_info->scale != NULL) ? buffer_info->scale[0] : 0.0f;
	const int32_t zero_point =
		(buffer_info->offset != NULL) ? (int32_t)buffer_info->offset[0] : 0;

	return (((float)(*raw_value_ptr)) - (float)zero_point) * scale;
}

/* OBB face-localizer bridge.
 * output_buffers_info array: [0]=box, [1]=confidence, with a final NULL terminator.
 * The box is [cx, cy, w, h] in normalised [0,1] coordinates. */
static bool AppAI_DecodeObbFaceV2(
	const LL_Buffer_InfoTypeDef *output_info,
	AppAI_SourceCrop            *obb_crop,
	AppAI_ObbBox                *obb_box)
{
	if ((output_info == NULL) || (obb_crop == NULL) || (obb_box == NULL))
	{
		return false;
	}

	const LL_Buffer_InfoTypeDef *box_info = NULL;
	const LL_Buffer_InfoTypeDef *conf_info = NULL;

	for (const LL_Buffer_InfoTypeDef *info = output_info; info->name != NULL; ++info)
	{
		const size_t output_len = (size_t)LL_Buffer_len(info);

		if (output_len == 4U)
		{
			if (box_info != NULL)
			{
				return false;
			}
			box_info = info;
			continue;
		}

		if (output_len == 1U)
		{
			if (conf_info != NULL)
			{
				return false;
			}
			conf_info = info;
			continue;
		}

		/* The live OBB contract should stay at one 4-value box tensor and one
		 * scalar confidence tensor. If the shape changes, fail closed. */
		return false;
	}

	if ((box_info == NULL) || (conf_info == NULL))
	{
		return false;
	}

	if ((box_info->scale == NULL) || (box_info->offset == NULL) ||
		(conf_info->scale == NULL) || (conf_info->offset == NULL))
	{
		return false;
	}

	const int8_t *box_raw = (const int8_t *)LL_Buffer_addr_start(box_info);
	const int8_t *conf_raw = (const int8_t *)LL_Buffer_addr_start(conf_info);
	if ((box_raw == NULL) || (conf_raw == NULL))
	{
		return false;
	}

	float center_x = AppAI_DecodeQuantizedScalar(box_info, &box_raw[0]);
	float center_y = AppAI_DecodeQuantizedScalar(box_info, &box_raw[1]);
	float box_w = AppAI_DecodeQuantizedScalar(box_info, &box_raw[2]);
	float box_h = AppAI_DecodeQuantizedScalar(box_info, &box_raw[3]);
	float confidence = AppAI_DecodeQuantizedScalar(conf_info, &conf_raw[0]);

	if (!isfinite(center_x) || !isfinite(center_y) ||
		!isfinite(box_w) || !isfinite(box_h) ||
		!isfinite(confidence))
	{
		return false;
	}

	center_x = AppAI_ClampNormalizedUnitFloat(center_x);
	center_y = AppAI_ClampNormalizedUnitFloat(center_y);
	box_w = AppAI_ClampNormalizedUnitFloat(box_w);
	box_h = AppAI_ClampNormalizedUnitFloat(box_h);
	confidence = AppAI_ClampNormalizedUnitFloat(confidence);

	if (box_w < APP_AI_OBB_MIN_BOX_RATIO)
	{
		box_w = APP_AI_OBB_MIN_BOX_RATIO;
	}
	if (box_h < APP_AI_OBB_MIN_BOX_RATIO)
	{
		box_h = APP_AI_OBB_MIN_BOX_RATIO;
	}

	obb_box->center_x = center_x;
	obb_box->center_y = center_y;
	obb_box->box_w = box_w;
	obb_box->box_h = box_h;
	obb_box->confidence = confidence;
	obb_box->angle_rad = 0.0f;
	obb_box->gauge_center_x = center_x;
	obb_box->gauge_center_y = center_y;

	/* Populate pixel crop from centre + box size, with OBB crop scale. */
	float cx_px = center_x * (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	float cy_px = center_y * (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	float bw_px = box_w    * (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	float bh_px = box_h    * (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;

	float crop_w = bw_px * APP_AI_OBB_CROP_SCALE;
	float crop_h = bh_px * APP_AI_OBB_CROP_SCALE;

	/* Clamp crop to frame bounds. */
	float x_min_f = cx_px - crop_w * 0.5f;
	float y_min_f = cy_px - crop_h * 0.5f;

	if (x_min_f < 0.0f) { x_min_f = 0.0f; }
	if (y_min_f < 0.0f) { y_min_f = 0.0f; }
	if ((x_min_f + crop_w) > (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS)
	{
		crop_w = (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS - x_min_f;
	}
	if ((y_min_f + crop_h) > (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS)
	{
		crop_h = (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS - y_min_f;
	}
	if ((crop_w < APP_AI_OBB_MIN_CROP_SIZE_PIXELS) || (crop_h < APP_AI_OBB_MIN_CROP_SIZE_PIXELS))
	{
		return false;   /* degenerate crop — reject */
	}

	obb_crop->x_min  = (size_t)(x_min_f + 0.5f);
	obb_crop->y_min  = (size_t)(y_min_f + 0.5f);
	obb_crop->width  = (size_t)(crop_w + 0.5f);
	obb_crop->height = (size_t)(crop_h + 0.5f);

	return true;
}
#endif /* !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/

/* Split helper implementation into a companion include to keep this file manageable. */
#include "app_ai_helpers.inc"

/* Split out the runtime tail into a companion include to keep this file manageable. */
#include "app_ai_runtime_tail.inc"
